src/Catalogs/ar_ДополнительныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_ДополнительныеНастройки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ЗначениеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Ответственный</Name>					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ДатаИзменения</Name>					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ar_Значения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_ЗначениеСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Включено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ar_Соответствие</Name>				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Ключ</Name>							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Значение</Name>							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_ЗначениеСтрока</Name>							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ar_Настройки/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// AgentRunner для 1С
//
// Лицензия: MIT. Полный текст — в файле LICENSE в корне репозитория.
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_Настройки (Settings AgentRunner).
//
// Тонкий фасад доступа к универсальному key-value справочнику
// ar_ДополнительныеНастройки (PAY-01) - по образцу ar_Константы, но поверх
// справочника (ключ настройки = Код элемента вместо имени константы Xxx).
//
// ЧТЕНИЕ (ЗначениеНастройки/СписокЗначений/НастройкаЗаполнена) идёт через
// ar_НастройкиПовтИсп - общий модуль с "Возвращаемые значения: на время
// сеанса" (по образцу sp_ДополнительныеНастройкиПовтИсп): повторное чтение
// той же настройки не читает базу, изменение настройки подхватывается
// прикладным кодом с нового сеанса/запуска фонового задания. Для достоверности
// СРАЗУ ПОСЛЕ записи (тот же сеанс) используйте ЗначениеНастройкиБезКэша/
// СписокЗначенийБезКэша - так читают tool get_settings и самопроверки.
//
// Хранение: скалярное значение - реквизит ar_Значение (составной: Булево/
// Число/Дата) либо ar_ЗначениеСтрока (строка неограниченной длины) - строка
// неограниченной длины не может входить в составной тип реквизита
// (платформенное ограничение), поэтому строки хранятся отдельным полем.
// Списковое значение - табличная часть ar_Значения с той же парой полей на
// строку. Именованные маппины ключ->значение - ТЧ ar_Соответствие
// (СоответствиеНастройки/ЗначениеПоКлючуСоответствия).
//
// Функции записи (УстановитьЗначение/УстановитьСписок) - единственные
// мутирующие точки входа, работают в транзакции, в правах вызывающего кода.
//
// См. спеку: .docs/specs/PAY-01.md, §Справочник ar_ДополнительныеНастройки.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает скалярное значение настройки по ключу.
//
// Различение "скаляр не задан" от "явно задан Ложь/0/пустая Дата" - без
// отдельного флага заполненности в справочнике невозможно отличить "оператор
// сохранил 0" от "оператор ничего не вводил" по самому значению ar_Значение.
// Решение: значение считается заданным, если у настройки НЕПУСТА ТЧ
// ar_Значения (тогда это настройка-список - ЗначениеНастройки не её случай,
// возвращаем Дефолт) - иначе берём его по факту хранения: непустая
// ar_ЗначениеСтрока -> строка; иначе -> ar_Значение КАК ЕСТЬ (Булево=Ложь/
// Число=0/пустая Дата - ЗАКОННЫЕ значения, УстановитьЗначение всегда пишет
// осмысленно в одно из двух полей).
//
// Параметры:
//  Ключ   - Строка               - код элемента справочника (Код).
//  Дефолт - Произвольный         - значение при отсутствии активной настройки.
//
// Возвращаемое значение:
//  Произвольный - значение настройки либо Дефолт.
//
Функция ЗначениеНастройки(Знач Ключ, Знач Дефолт = Неопределено) Экспорт

	// Кэш сеанса (ar_НастройкиПовтИсп, ПовтИсп = На Время Сеанса): повторное
	// чтение той же настройки не читает базу. Актуальность сразу после записи
	// в том же сеансе - только через ЗначениеНастройкиБезКэша.
	Возврат ar_НастройкиПовтИсп.ЗначениеНастройки(Ключ, Дефолт);

КонецФункции

// То же, что ЗначениеНастройки, но минуя кэш сеанса - прямой запрос к базе.
// Для чтения сразу после записи настройки в том же сеансе (tool get_settings,
// old_value карточки подтверждения, самопроверки).
//
// Параметры:
//  Ключ   - Строка       - код элемента справочника (Код).
//  Дефолт - Произвольный - значение при отсутствии активной настройки.
//
// Возвращаемое значение:
//  Произвольный - значение настройки либо Дефолт.
//
Функция ЗначениеНастройкиБезКэша(Знач Ключ, Знач Дефолт = Неопределено) Экспорт

	Запись = НайтиЗаписьПоКлючу(Ключ);
	Если Запись = Неопределено Тогда
		Возврат Дефолт;
	КонецЕсли;

	Если ЕстьЭлементыСписка(Ключ) Тогда
		Возврат Дефолт;
	КонецЕсли;

	Если Не ПустаяСтрока(Запись.ar_ЗначениеСтрока) Тогда
		Возврат Запись.ar_ЗначениеСтрока;
	КонецЕсли;

	Возврат Запись.ar_Значение;

КонецФункции

// Возвращает список значений настройки (табличная часть ar_Значения) по
// ключу. Ключ не найден, настройка выключена или ТЧ пуста - пустой Массив
// (НЕ ошибка).
//
// Параметры:
//  Ключ - Строка - код элемента справочника (Код).
//
// Возвращаемое значение:
//  Массив - значения строк ТЧ (ar_Значение для не-строковых, ar_ЗначениеСтрока
//           для строк), отфильтрованные по ar_Включено строки.
//
Функция СписокЗначений(Знач Ключ) Экспорт

	// Кэш сеанса (см. ЗначениеНастройки).
	Возврат ar_НастройкиПовтИсп.СписокЗначений(Ключ);

КонецФункции

// То же, что СписокЗначений, но минуя кэш сеанса - прямой запрос к базе
// (чтение сразу после записи в том же сеансе).
//
// Параметры:
//  Ключ - Строка - код элемента справочника (Код).
//
// Возвращаемое значение:
//  Массив - значения строк ТЧ.
//
Функция СписокЗначенийБезКэша(Знач Ключ) Экспорт

	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Значения.ar_Значение КАК Значение,
		|	Значения.ar_ЗначениеСтрока КАК ЗначениеСтрока
		|ИЗ
		|	Справочник.ar_ДополнительныеНастройки.ar_Значения КАК Значения
		|ГДЕ
		|	Значения.Ссылка.Код = &Ключ
		|	И Значения.Ссылка.ar_Включено
		|	И НЕ Значения.Ссылка.ПометкаУдаления
		|	И Значения.ar_Включено
		|УПОРЯДОЧИТЬ ПО
		|	Значения.НомерСтроки";
	Запрос.УстановитьПараметр("Ключ", Ключ);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ПустаяСтрока(Выборка.ЗначениеСтрока) Тогда
			Результат.Добавить(Выборка.ЗначениеСтрока);
		Иначе
			Результат.Добавить(Выборка.Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает соответствие ключ->значение из ТЧ ar_Соответствие настройки
// (кэш сеанса). Ключ не найден/настройка выключена/ТЧ пуста - пустое
// Соответствие (НЕ ошибка). Значение берётся из ar_ЗначениеСтрока, если она
// непуста (строки длиннее 1024), иначе из ar_Значение. Возвращаемое
// Соответствие кэшируется по ссылке - не мутировать.
//
// Параметры:
//  Код - Строка - код элемента справочника (Код).
//
// Возвращаемое значение:
//  Соответствие - ключ (Булево/Число/Дата/Строка/Ссылка) -> значение.
//
Функция СоответствиеНастройки(Знач Код) Экспорт

	Возврат ar_НастройкиПовтИсп.СоответствиеНастройки(Код);

КонецФункции

// Возвращает значение из ТЧ ar_Соответствие по ключу соответствия (кэш
// сеанса; см. СоответствиеНастройки).
//
// Параметры:
//  Код  - Строка       - код элемента справочника (Код).
//  Ключ - Произвольный - ключ в ТЧ ar_Соответствие.
//
// Возвращаемое значение:
//  Произвольный - значение либо Неопределено, если ключа нет.
//
Функция ЗначениеПоКлючуСоответствия(Знач Код, Знач Ключ) Экспорт

	Возврат ar_НастройкиПовтИсп.ЗначениеПоКлючуСоответствия(Код, Ключ);

КонецФункции

// Булево - есть ли активная (ar_Включено) настройка с этим Код: скалярное
// значение заполнено ИЛИ табличная часть непуста.
//
// Параметры:
//  Ключ - Строка - код элемента справочника (Код).
//
// Возвращаемое значение:
//  Булево.
//
Функция НастройкаЗаполнена(Знач Ключ) Экспорт

	// Уникальное непустое значение-маркер как Дефолт: если ЗначениеНастройки
	// вернула именно его - значит активной скалярной настройки нет.
	Маркер = Неопределено;
	Скаляр = ЗначениеНастройки(Ключ, Маркер);
	Если Скаляр <> Маркер Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат СписокЗначений(Ключ).Количество() > 0;

КонецФункции

// Каталог известных ключей настроек расширения - ЕДИНСТВЕННАЯ точка
// расширения списка по мере появления новых задач.
//
// Живёт в общем модуле (а не в форме списка), потому что нужен из двух мест:
//  * обработчик обновления релиза ar_ОбновлениеРасширения (автоматически,
//    при накатывании новой версии .cfe);
//  * команда "Заполнить типовые настройки" формы списка (вручную).
// Пока каталог лежал только в форме, справочник на обновлении оставался
// пустым - настройки появлялись лишь после ручного нажатия кнопки.
//
// Возвращаемое значение:
//  Массив из Структура { Ключ, Наименование, Описание }.
//
Функция ТиповыеНастройки() Экспорт

	ТиповыеНастройки = Новый Массив;

	ТиповыеНастройки.Добавить(Новый Структура("Ключ, Наименование, Описание",
		"ОрганизацииКонтроляОплат",
		НСтр("ru = 'Организации контроля оплат'; en = 'Payment control organizations'"),
		НСтр("ru = 'Список организаций (Справочник.Организации), по которым агент проверяет неоплаченные счета покупателей (tool list_unpaid_invoices). Заполните табличную часть значений и включите настройку - иначе, если в базе несколько организаций, tool вернёт ошибку organization_scope_not_configured.';
			|en = 'List of organizations (Catalog.Организации) the agent checks for unpaid customer invoices (list_unpaid_invoices tool). Fill in the values table and enable the setting - otherwise, if the database has multiple organizations, the tool returns organization_scope_not_configured.'")));

	ТиповыеНастройки.Добавить(Новый Структура("Ключ, Наименование, Описание",
		"ОбъектыСДиалогомИИ",
		НСтр("ru = 'Объекты с диалогом с AI'; en = 'Objects with AI dialog'"),
		НСтр("ru = 'Объекты (справочники и документы), в формах которых показывается команда «Диалог с AI». Элемент списка - ссылка на ИдентификаторыОбъектовМетаданных либо строка полного имени вида «Справочник.Контрагенты». Пустой или выключенный список - команда не показывается нигде. Внимание: состав команд кэшируется на сеанс - изменение действует в НОВЫХ сеансах.';
			|en = 'Objects (catalogs and documents) whose forms show the «Dialog with AI» command. A list item is a reference to ИдентификаторыОбъектовМетаданных or a full-name string like «Справочник.Контрагенты». An empty or disabled list hides the command everywhere. Note: the command set is cached per session - changes apply to NEW sessions.'")));

	Возврат ТиповыеНастройки;

КонецФункции

// Идемпотентно создаёт недостающие типовые настройки ядра (см.
// ТиповыеНастройки). Уже существующие ключи НЕ трогает - введённые
// администратором значения и признак ar_Включено сохраняются. Типовые
// настройки ядра значений по умолчанию не имеют - создаются выключенными
// (ar_Включено = Ложь), администратор включает после заполнения.
//
// Возвращаемое значение:
//  Структура { Создано - Число, БылоРанее - Число }.
//
Функция ЗаполнитьТиповыеНастройки() Экспорт

	Возврат ДобавитьНедостающиеНастройки(ТиповыеНастройки());

КонецФункции

// Идемпотентно создаёт недостающие настройки по описаниям из манифеста пакета
// (спека agentrunner-21 п.Б.6): {Ключ, Наименование, Описание,
// ЗначениеПоУмолчанию}. Уже существующие ключи НЕ трогаются - введённые
// администратором значения и признак ar_Включено сохраняются; совпадение
// ключей между пакетами не проверяется, существующий ключ считается общим.
//
// Существующие коды вычитываются ОДНИМ запросом до цикла, ВКЛЮЧАЯ помеченные
// на удаление (после agentrunner-18 Код уникален - создание элемента с кодом
// помеченного на удаление элемента упало бы; std "CreateQueryInCycle").
//
// Новая настройка со значением по умолчанию (Строка -> ar_ЗначениеСтрока,
// Число/Булево -> ar_Значение) создаётся включённой (ar_Включено = Истина);
// без значения по умолчанию - выключенной (ar_Включено = Ложь), администратор
// заполняет и включает.
//
// Параметры:
//  ОписанияНастроек - Массив из Структура {Ключ, Наименование, Описание,
//                     ЗначениеПоУмолчанию} - описания из манифеста пакета
//                     либо ТиповыеНастройки(); корректность состава
//                     проверяет ВалидироватьМанифест (НастройкиПакетаКорректны).
//
// Возвращаемое значение:
//  Структура { Создано - Число, БылоРанее - Число }.
//
Функция ДобавитьНедостающиеНастройки(Знач ОписанияНастроек) Экспорт

	Итог = Новый Структура("Создано, БылоРанее", 0, 0);

	СуществующиеКоды = СуществующиеКодыНастроек();

	Для Каждого ОписаниеНастройки Из ОписанияНастроек Цикл

		Ключ = "";
		ОписаниеНастройки.Свойство("Ключ", Ключ);
		Если ПустаяСтрока(Ключ) Тогда
			Продолжить;
		КонецЕсли;

		Если СуществующиеКоды.Найти(Ключ) <> Неопределено Тогда
			Итог.БылоРанее = Итог.БылоРанее + 1;
			Продолжить;
		КонецЕсли;

		Наименование = "";
		ОписаниеНастройки.Свойство("Наименование", Наименование);
		Описание = "";
		ОписаниеНастройки.Свойство("Описание", Описание);

		ЗначениеПоУмолчанию = Неопределено;
		ОписаниеНастройки.Свойство("ЗначениеПоУмолчанию", ЗначениеПоУмолчанию);
		ЕстьЗначениеПоУмолчанию = (ЗначениеПоУмолчанию <> Неопределено);

		НовыйОбъект = Справочники.ar_ДополнительныеНастройки.СоздатьЭлемент();
		НовыйОбъект.Код = Ключ;
		НовыйОбъект.Наименование = ?(ПустаяСтрока(Наименование), Ключ, Наименование);
		НовыйОбъект.ar_Описание = Описание;

		Если ЕстьЗначениеПоУмолчанию Тогда
			Если ТипЗнч(ЗначениеПоУмолчанию) = Тип("Строка") Тогда
				НовыйОбъект.ar_ЗначениеСтрока = ЗначениеПоУмолчанию;
				НовыйОбъект.ar_Значение = Ложь;
			Иначе
				НовыйОбъект.ar_Значение = ЗначениеПоУмолчанию;
				НовыйОбъект.ar_ЗначениеСтрока = "";
			КонецЕсли;
			НовыйОбъект.ar_Включено = Истина;
		Иначе
			НовыйОбъект.ar_Включено = Ложь;
		КонецЕсли;

		НовыйОбъект.Записать();

		Итог.Создано = Итог.Создано + 1;

	КонецЦикла;

	Возврат Итог;

КонецФункции

// Коды всех элементов справочника настроек одним запросом, БЕЗ отбора по
// пометке удаления: Код уникален по справочнику (agentrunner-18), элемент
// с кодом помеченного на удаление элемента создать нельзя - такой ключ
// считается существующим (спека agentrunner-21 п.Б.6).
//
// Возвращаемое значение:
//  Массив из Строка.
//
Функция СуществующиеКодыНастроек()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Настройки.Код КАК Код
		|ИЗ
		|	Справочник.ar_ДополнительныеНастройки КАК Настройки";

	СуществующиеКоды = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СуществующиеКоды.Добавить(Выборка.Код);
	КонецЦикла;

	Возврат СуществующиеКоды;

КонецФункции

// Устанавливает скалярное значение настройки по ключу. Находит существующий
// элемент по Код либо создаёт новый (если явно разрешено вызывающим кодом -
// см. параметр СоздатьЕслиНеНайден). Различает Строку (-> ar_ЗначениеСтрока)
// от прочих типов (-> ar_Значение); при записи скалярного значения табличная
// часть ar_Значения очищается (взаимоисключимость Скаляр/Список).
//
// Параметры:
//  Ключ                - Строка       - код элемента справочника (Код).
//  Значение            - Произвольный - Булево/Число/Дата/Строка.
//  СоздатьЕслиНеНайден - Булево       - Истина: создать элемент, если Код не
//                        найден. Ложь (по умолчанию): бросить исключение.
//  Наименование        - Строка       - наименование для нового элемента
//                        (используется только при создании).
//  Ответственный       - СправочникСсылка.Пользователи - кто внёс изменение.
//                        По умолчанию Неопределено: атрибуцию заполнит
//                        ПередЗаписью справочника текущим пользователем
//                        сеанса записи. Явная передача нужна, когда запись
//                        выполняется от служебного пользователя (фоновое
//                        задание, исполнение approval), а ответственный -
//                        фактический инициатор.
//
Процедура УстановитьЗначение(Знач Ключ, Знач Значение, Знач СоздатьЕслиНеНайден = Ложь,
	Знач Наименование = "", Знач Ответственный = Неопределено) Экспорт

	НачатьТранзакцию();
	Попытка

		Объект = НайтиОбъектПоКлючу(Ключ, СоздатьЕслиНеНайден, Наименование);

		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			Объект.ar_ЗначениеСтрока = Значение;
			Объект.ar_Значение = Ложь;
		Иначе
			Объект.ar_Значение = Значение;
			Объект.ar_ЗначениеСтрока = "";
		КонецЕсли;

		// Скаляр и список взаимоисключимы на уровне UI/использования - при явной
		// установке скаляра список очищается, чтобы не оставалось противоречивых
		// данных (СписокЗначений и ЗначениеНастройки не должны расходиться).
		Объект.ar_Значения.Очистить();

		Если ЗначениеЗаполнено(Ответственный) Тогда
			Объект.ar_Ответственный = Ответственный;
		КонецЕсли;

		Объект.Записать();
		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Полностью пересоздаёт табличную часть ar_Значения настройки из массива
// значений. Та же типовая развилка Строка/прочее на каждый элемент массива.
// Скалярные поля объекта (ar_Значение/ar_ЗначениеСтрока) при этом очищаются.
//
// Параметры:
//  Ключ                - Строка - код элемента справочника (Код).
//  МассивЗначений      - Массив - значения строк (Булево/Число/Дата/Строка).
//  СоздатьЕслиНеНайден - Булево - Истина: создать элемент, если Код не найден.
//  Наименование        - Строка - наименование для нового элемента.
//  Ответственный       - СправочникСсылка.Пользователи - см. УстановитьЗначение.
//
Процедура УстановитьСписок(Знач Ключ, Знач МассивЗначений, Знач СоздатьЕслиНеНайден = Ложь,
	Знач Наименование = "", Знач Ответственный = Неопределено) Экспорт

	НачатьТранзакцию();
	Попытка

		Объект = НайтиОбъектПоКлючу(Ключ, СоздатьЕслиНеНайден, Наименование);

		Объект.ar_Значение = Ложь;
		Объект.ar_ЗначениеСтрока = "";
		Объект.ar_Значения.Очистить();

		Для Каждого Элемент Из МассивЗначений Цикл
			НоваяСтрока = Объект.ar_Значения.Добавить();
			Если ТипЗнч(Элемент) = Тип("Строка") Тогда
				НоваяСтрока.ar_ЗначениеСтрока = Элемент;
				НоваяСтрока.ar_Значение = Ложь;
			Иначе
				НоваяСтрока.ar_Значение = Элемент;
				НоваяСтрока.ar_ЗначениеСтрока = "";
			КонецЕсли;
			НоваяСтрока.ar_Включено = Истина;
		КонецЦикла;

		Если ЗначениеЗаполнено(Ответственный) Тогда
			Объект.ar_Ответственный = Ответственный;
		КонецЕсли;

		Объект.Записать();
		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Находит активную (ar_Включено, не помечена на удаление) запись справочника
// по Код через запрос (быстрое чтение без получения объекта).
//
// Параметры:
//  Ключ - Строка - код элемента справочника (Код).
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса-строка (после Следующий) как Структура-подобный
//  объект { ar_Значение, ar_ЗначениеСтрока, КоличествоЭлементовСписка }
//  либо Неопределено.
//
// Булево - есть ли хотя бы одна ВКЛЮЧЁННАЯ строка в ТЧ ar_Значения активной
// настройки с этим Код. Лёгкая проверка "список непуст" без чтения значений
// (сами значения читает СписокЗначений тем же способом обращения к ТЧ).
//
// Параметры:
//  Ключ - Строка - код элемента справочника (Код).
//
// Возвращаемое значение:
//  Булево.
//
Функция ЕстьЭлементыСписка(Знач Ключ)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Признак
		|ИЗ
		|	Справочник.ar_ДополнительныеНастройки.ar_Значения КАК Значения
		|ГДЕ
		|	Значения.Ссылка.Код = &Ключ
		|	И Значения.Ссылка.ar_Включено
		|	И НЕ Значения.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ключ", Ключ);

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

Функция НайтиЗаписьПоКлючу(Знач Ключ)

	// Вложенная таблица через ".(*)" платформой НЕ поддерживается
	// (Синтаксическая ошибка "*"). Вместо неё - отдельный лёгкий запрос
	// "есть ли хоть одна строка ТЧ": вызывающему коду нужен только факт
	// "список непуст", сами значения читает СписокЗначений (тот же способ
	// обращения к ТЧ Справочник.ar_ДополнительныеНастройки.ar_Значения).
	// Соединение с подзапросом не используется (std JoinWithSubQuery).
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Настройки.ar_Значение КАК ar_Значение,
		|	Настройки.ar_ЗначениеСтрока КАК ar_ЗначениеСтрока
		|ИЗ
		|	Справочник.ar_ДополнительныеНастройки КАК Настройки
		|ГДЕ
		|	Настройки.Код = &Ключ
		|	И Настройки.ar_Включено
		|	И НЕ Настройки.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ключ", Ключ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Находит объект справочника по Код (для записи). Создаёт новый, если не
// найден и СоздатьЕслиНеНайден = Истина; иначе бросает исключение
// setting_not_found (текст на двух языках).
//
// Параметры:
//  Ключ                - Строка - код элемента справочника (Код).
//  СоздатьЕслиНеНайден - Булево - Истина: создать элемент, если Код не найден.
//  Наименование        - Строка - наименование для нового элемента.
//
// Возвращаемое значение:
//  СправочникОбъект.ar_ДополнительныеНастройки - найденный либо новый объект
//  (не записан).
//
Функция НайтиОбъектПоКлючу(Знач Ключ, Знач СоздатьЕслиНеНайден, Знач Наименование)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Настройки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ar_ДополнительныеНастройки КАК Настройки
		|ГДЕ
		|	Настройки.Код = &Ключ
		|	И НЕ Настройки.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ключ", Ключ);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка.ПолучитьОбъект();
	КонецЕсли;

	Если Не СоздатьЕслиНеНайден Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Настройка с ключом ""%1"" не найдена';
				|en = 'Setting with key ""%1"" not found'"), Ключ);
	КонецЕсли;

	НовыйОбъект = Справочники.ar_ДополнительныеНастройки.СоздатьЭлемент();
	НовыйОбъект.Код = Ключ;
	НовыйОбъект.Наименование = ?(ПустаяСтрока(Наименование), Ключ, Наименование);
	НовыйОбъект.ar_Включено = Истина;
	Возврат НовыйОбъект;

КонецФункции

#КонецОбласти
